In [24]:
import pandas as pd
import opendatasets as od
import numpy as np

In [25]:
od.download("https://www.kaggle.com/datasets/sankha1998/student-semester-result")

Skipping, found downloaded files in ".\student-semester-result" (use force=True to force download)

In [26]:
df=pd.read_csv('student-semester-result/data.csv')

In [27]:
df.head()

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   1st           176 non-null    float64
 1   2nd           174 non-null    float64
 2   3rd           176 non-null    float64
 3   4th           173 non-null    float64
 4   5th           172 non-null    float64
 5   College Code  178 non-null    int64
 6   Gender        177 non-null    object
 7   Roll          132 non-null    float64
 8   Roll no.      46 non-null     float64
 9   Subject Code  178 non-null    int64
dtypes: float64(7), int64(2), object(1)
memory usage: 14.0+ KB

In [29]:
df.isnull()

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,False,False,False,False,False,False,False,True,False,False
1,False,False,False,False,False,False,False,True,False,False
2,False,False,False,False,False,False,False,True,False,False
3,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...
173,False,False,False,False,False,False,False,False,True,False
174,False,False,False,False,False,False,False,False,True,False
175,False,False,False,False,False,False,False,False,True,False
176,False,False,False,False,False,False,False,False,True,False
177,False,False,False,False,False,False,False,False,True,False

In [30]:
df.isnull().sum()

1st               2
2nd               4
3rd               2
4th               5
5th               6
College Code      0
Gender            1
Roll             46
Roll no.        132
Subject Code      0
dtype: int64

In [31]:
avg_1st=df['1st'].astype("float64").mean(axis=0)
avg_2nd=df['2nd'].astype("float64").mean(axis=0)
avg_3rd=df['3rd'].astype("float64").mean(axis=0)
avg_4th=df['4th'].astype("float64").mean(axis=0)
avg_5th=df['5th'].astype("float64").mean(axis=0)

In [32]:
print("average marks of 1st paper:",avg_1st)
print("average marks of 2nd paper:",avg_2nd)
print("average marks of 3rd paper:",avg_3rd)
print("average marks of 4th paper:",avg_4th)
print("average marks of 5th paper:",avg_5th)

average marks of 1st paper: 7.038863636363637
average marks of 2nd paper: 6.943390804597701
average marks of 3rd paper: 6.6225
average marks of 4th paper: 7.027745664739886
average marks of 5th paper: 7.432558139534884

In [33]:
df['1st'].replace(np.nan,avg_1st,inplace=True)
df['2nd'].replace(np.nan,avg_2nd,inplace=True)
df['3rd'].replace(np.nan,avg_3rd,inplace=True)
df['4th'].replace(np.nan,avg_4th,inplace=True)
df['5th'].replace(np.nan,avg_5th,inplace=True)

In [34]:
df.isnull().sum()

1st               0
2nd               0
3rd               0
4th               0
5th               0
College Code      0
Gender            1
Roll             46
Roll no.        132
Subject Code      0
dtype: int64

In [35]:
df['Gender'].replace(np.nan,'male',inplace=True)

In [36]:
df.isnull().sum()

1st               0
2nd               0
3rd               0
4th               0
5th               0
College Code      0
Gender            0
Roll             46
Roll no.        132
Subject Code      0
dtype: int64

In [37]:
df['Roll'].fillna(0,inplace=True)
df['Roll no.'].fillna(0,inplace=True)

In [38]:
df.head()

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,0.0,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,0.0,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,0.0,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,0.0,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,0.0,17024.0,16

In [39]:
df['Roll_no']=df['Roll']+df['Roll no.']
df.drop(columns=['Roll','Roll no.'],inplace=True)

In [40]:
df.head()

    1st   2nd   3rd   4th   5th  College Code  Gender  Subject Code  Roll_no
0  8.11  7.68  7.11  7.43  8.18           115  Female            16  17020.0
1  6.48  5.90  4.15  4.29  4.96           115    Male            16  17021.0
2  8.41  8.24  7.52  8.25  7.75           115  Female            16  17022.0
3  7.33  6.83  6.33  6.79  6.89           115    Male            16  17023.0
4  7.89  7.34  7.22  7.32  7.46           115    Male            16  17024.0

In [41]:
df.isnull().sum()

1st             0
2nd             0
3rd             0
4th             0
5th             0
College Code    0
Gender          0
Subject Code    0
Roll_no         0
dtype: int64

In [55]:
q1,q3=np.percentile(df['1st'],[25,75])
print(q1,q3)

6.45 7.59

In [56]:
iqr=q3-q1

In [57]:
iqr

1.1399999999999997

In [59]:
lower_fence=q1-(1.5*iqr)
upper_fence=q3+(1.5*iqr)

In [60]:
print(lower_fence,upper_fence)

4.74 9.299999999999999

In [68]:
upper = np.where(df['1st'] >= upper_fence)[0]
lower = np.where(df['1st'] <= lower_fence)[0]

In [69]:
print(upper)

[]

In [70]:
print(lower)

[63 73]

In [71]:
outliers=[]
for i in df['1st']:
    if i<=lower_fence or i>=upper_fence:
        outliers.append(i)

In [72]:
print(outliers)

[3.85, 4.19]

In [73]:
df.shape

(178, 9)

In [74]:
df.drop(index=upper, inplace=True)
df.drop(index=lower, inplace=True)

In [75]:
df.shape

(176, 9)

In [76]:
max1=df['1st'].max()

In [77]:
max2=df['2nd'].max()
max3=df['3rd'].max()
max4=df['4th'].max()
max5=df['5th'].max()

In [78]:
print(max1,max2,max3,max4,max5)

9.15 9.21 9.59 9.31 9.46

In [79]:
max_val=[max1,max2,max3,max4,max5]
cgpa_col=['1st','2nd','3rd','4th','5th']

In [83]:
for col,maxi in zip(cgpa_col,max_val):
    df[col+'_Percentage']=(df[col]/maxi)*100

In [84]:
df.head()

,1st,2nd,3rd,4th,5th,College Code,Gender,Subject Code,Roll_no,1st_Percentage,2nd_Percentage,3rd_Percentage,4th_Percentage,5th_Percentage
0,8.11,7.68,7.11,7.43,8.18,115,Female,16,17020.0,88.633880,83.387622,74.139729,79.806660,86.469345
1,6.48,5.90,4.15,4.29,4.96,115,Male,16,17021.0,70.819672,64.060803,43.274244,46.079484,52.431290
2,8.41,8.24,7.52,8.25,7.75,115,Female,16,17022.0,91.912568,89.467970,78.415016,88.614393,81.923890
3,7.33,6.83,6.33,6.79,6.89,115,Male,16,17023.0,80.109290,74.158523,66.006257,72.932331,72.832981
4,7.89,7.34,7.22,7.32,7.46,115,Male,16,17024.0,86.229508,79.695983,75.286757,78.625134,78.858351